/*
 * @file practice1y2022.c
 * @autor Узун І. Д., гр. 515-б
 * @date 10.07.2022
 * @brief Навчальна практика
 * @task Завдання: Вывести все числа, представимые в виде суммы двух кубов. */
 /* Написать программу, которая вводит с клавиатуры натуральное число N
  * и выводит все числа, не превосходящие N, которые можно представить
  * в виде суммы кубов двух натуральных чисел. */

#include <stdio.h>
#include <math.h>

int main()
{
    int N;
    int i = 0;
    int k = 0;
    double p = 0;

    printf("Enter N: ");
    scanf_s("%i", &N);

}